; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	spectrograph0 - mode
	infrared1 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	Star3 - direction
	Star4 - direction
	GroundStation5 - direction
	GroundStation7 - direction
	Star8 - direction
	Star10 - direction
	GroundStation9 - direction
	GroundStation6 - direction
	Star11 - direction
	Star12 - direction
	Star13 - direction
	Planet14 - direction
	Star15 - direction
	Planet16 - direction
	Planet17 - direction
	Star18 - direction
	Star19 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 infrared1)
	(calibration_target instrument0 GroundStation9)
	(supports instrument1 infrared1)
	(calibration_target instrument1 GroundStation6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
)
(:goal (and
	(pointing satellite0 GroundStation1)
	(have_image Star11 spectrograph0)
	(have_image Star12 infrared1)
	(have_image Star13 spectrograph0)
	(have_image Planet14 infrared1)
	(have_image Star15 infrared1)
	(have_image Planet16 spectrograph0)
	(have_image Planet17 spectrograph0)
	(have_image Star18 infrared1)
	(have_image Star19 spectrograph0)
))

)

; plan
1. (turn_to satellite0 groundstation9 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 groundstation9)
   goals met: 0 of 10
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 10
3. (calibrate satellite0 instrument0 groundstation9)
   added: (calibrated instrument0)
   goals met: 0 of 10
4. (turn_to satellite0 star11 groundstation9)
   deleted: (pointing satellite0 groundstation9)
   added: (pointing satellite0 star11)
   goals met: 0 of 10
5. (take_image satellite0 star11 instrument0 spectrograph0)
   added: (have_image star11 spectrograph0)
   goals met: 1 of 10
6. (turn_to satellite0 planet17 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 planet17)
   goals met: 1 of 10
7. (take_image satellite0 planet17 instrument0 spectrograph0)
   added: (have_image planet17 spectrograph0)
   goals met: 2 of 10
8. (turn_to satellite0 planet16 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 planet16)
   goals met: 2 of 10
9. (take_image satellite0 planet16 instrument0 spectrograph0)
   added: (have_image planet16 spectrograph0)
   goals met: 3 of 10
10. (turn_to satellite0 planet14 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 planet14)
   goals met: 3 of 10
11. (take_image satellite0 planet14 instrument0 infrared1)
   added: (have_image planet14 infrared1)
   goals met: 4 of 10
12. (turn_to satellite0 star12 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 star12)
   goals met: 4 of 10
13. (take_image satellite0 star12 instrument0 infrared1)
   added: (have_image star12 infrared1)
   goals met: 5 of 10
14. (turn_to satellite0 star13 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star13)
   goals met: 5 of 10
15. (take_image satellite0 star13 instrument0 spectrograph0)
   added: (have_image star13 spectrograph0)
   goals met: 6 of 10
16. (turn_to satellite0 star15 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star15)
   goals met: 6 of 10
17. (take_image satellite0 star15 instrument0 infrared1)
   added: (have_image star15 infrared1)
   goals met: 7 of 10
18. (turn_to satellite0 star18 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star18)
   goals met: 7 of 10
19. (take_image satellite0 star18 instrument0 infrared1)
   added: (have_image star18 infrared1)
   goals met: 8 of 10
20. (turn_to satellite0 star19 star18)
   deleted: (pointing satellite0 star18)
   added: (pointing satellite0 star19)
   goals met: 8 of 10
21. (take_image satellite0 star19 instrument0 spectrograph0)
   added: (have_image star19 spectrograph0)
   goals met: 9 of 10
22. (turn_to satellite0 groundstation1 star19)
   deleted: (pointing satellite0 star19)
   added: (pointing satellite0 groundstation1)
   goals met: 10 of 10
